<a href="https://colab.research.google.com/github/saadmarwan16/numpy_stack/blob/main/pandas_exercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [22]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [23]:
arr = np.array(np.random.randint(-10, high=11, size=(1500, 2)))
arr

array([[ 3,  4],
       [ 3, -1],
       [-2,  1],
       ...,
       [-5, -1],
       [ 8,  7],
       [ 0,  8]])

In [24]:
df = pd.DataFrame(arr, columns=['x1', 'x2'])
df.head()

   x1  x2
0   3   4
1   3  -1
2  -2   1
3  -6  -1
4  -5  -2

In [25]:
def square_x1(frame):
    return frame['x1'] ** 2

df['x1_squared'] = df.apply(square_x1, axis=1)
df.head()

   x1  x2  x1_squared
0   3   4           9
1   3  -1           9
2  -2   1           4
3  -6  -1          36
4  -5  -2          25

In [26]:
def square_x2(frame):
    return frame['x2'] ** 2

df['x2_squared'] = df.apply(square_x2, axis=1)
df.head()

   x1  x2  x1_squared  x2_squared
0   3   4           9          16
1   3  -1           9           1
2  -2   1           4           1
3  -6  -1          36           1
4  -5  -2          25           4

In [27]:
def find_product(frame):
    return frame['x1'] * frame['x2']

df['x1*x2'] = df.apply(find_product, axis=1)
df.head()

   x1  x2  x1_squared  x2_squared  x1*x2
0   3   4           9          16     12
1   3  -1           9           1     -3
2  -2   1           4           1     -2
3  -6  -1          36           1      6
4  -5  -2          25           4     10

In [29]:
def find_radius(frame):
    return np.sqrt(frame['x1_squared'] + frame['x2_squared'])

df['y'] = df.apply(find_radius, axis=1)
df.head()

   x1  x2  x1_squared  x2_squared  x1*x2         y
0   3   4           9          16     12  5.000000
1   3  -1           9           1     -3  3.162278
2  -2   1           4           1     -2  2.236068
3  -6  -1          36           1      6  6.082763
4  -5  -2          25           4     10  5.385165

In [31]:
df.to_csv('output.csv', index=False, header=True)